{
  "education": [
    {
      "awards_achievements": null,
      "degree": "DVS in IT support and troubleshooting",
      "department": "Information Technology",
      "duration": "2019-2021",
      "school_name": "College Saint-Michel"
    },
    {
      "awards_achievements": null,
      "degree": "Bachelor of Computer Science",
      "department": "Faculty of Engineering Science ",
      "duration": "2015-2018",
      "school_name": "UPF"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_HachemZerban",
  "highlighted_projects": [
    {
      "description": "Coded a program in **C** that manipulate heavy CSV files from the Ministry of education to extract valuable data like the average number of students enrolled in the computer science field. Generated sub-CSV files that encompass specific data like the list of Ph.D. computer science students in a specific region. Implemented different sorting algorithms like Quicksort and bubble sort to sort all records by age. Implemented a binary search algorithm to find certain records by using the first name. ",
      "git_url": "",
      "name": "CSV File Manipulator"
    },
    {
      "description": "Designed tables for car dealerships and built complex queries using Joins and subqueries like returning a list of customers that bought a model in the last week. This helped to gain valuable data insights that will be used for further marketing strategies.  Technologies used include **Microsoft SQL SERVER** and **Transact SQL.**",
      "git_url": null,
      "name": "Car Dealerships Database"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a monitoring tool for a cluster of servers to continuously record essential resource usage data as well as hardware specifications for each node and store the collected data on a database. I used  Linux Bash scripts, Docker, and PostgreSQL. The collected data will be used for further data analytics to balance the node's workload.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "**Twitter App:** ",
        "**JDBC App:** Developed a Java application to manage a relational database of a commercial website using Java, JDBC, PostgreSQL, Design Patterns, and Maven. The application implements the Data Access Object pattern to run CRUD   (create, read, update and delete ) operations on customer data and orders made by customers.",
        "**Grep App:** Developed a  Java application that mirrors the Linux grep command functionality that enables users to search recursively through directories to find a text pattern and then store the search results in an output file. I used Java, Linux Bash, Regex, Maven, and Docker to build the app. ",
        ""
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Hachem Zerban",
  "others": [
    {
      "bullets": [
        "Solving Puzzles with friends online ",
        "Organizing Soccer games ",
        "Reading technolgy articles "
      ],
      "title": "Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed new applications and implemented solutions to various problems within the Jarvis team using **Java, Linux, Bash, IntelliJ IDEA, Maven, Docker and Git**. Built Databases and table structures following data modeling techniques . Created SQL queries using **SQL and PostgreSQL** to retrieve essential pieces of information. Collaborated with team members on the delivery of application code using Agile Scrum. Made suggestions on how to improve the current application by adding new features.",
      "duration": "2021-present",
      "title": "Software Developer"
    },
    {
      "company": "Globale Education Connections",
      "description": "Provided level 1  Technical support to users. Ensured the installation of hardware and software components. Updated hardware and software inventory. Configured equipment, perform installations for users. Carried out devices troubleshooting.",
      "duration": "2020-2021",
      "title": "IT Technician"
    }
  ],
  "skills": {
    "competent": [
      "C#",
      "HTML/CSS",
      "XML/XSLT",
      "Docker",
      "Windows/MAC",
      "Android/IOS"
    ],
    "familiar": [
      "C",
      "Network Management",
      "Design patterns",
      "Digital security",
      "Cloud Computing"
    ],
    "proficient": [
      "Java 8",
      "Linux/Bash",
      "RDBMS",
      "Agile/Scrum",
      "Git/GitHub",
      "Maven",
      "UML"
    ]
  },
  "summary": "I'm a bilingual IT professional with 2 years of hands-on experience in IT support. I'm result-driven able to work in a fast-paced environment and able to handle difficult situations. I have successfully developed organizational applications following design methodologies such as Agile, Waterfall development method, and Iterative model. I'm adaptable to work both independently and with team members. I believe being open-minded, focused, and consistent are the important aspects of a good team member.  As a successful software developer, I seek opportunities to practice and push myself a bit harder than yesterday to keep my skills sharp and refreshed. I always try to stay updated on the latest trends in technology by reading the latest technology news. My goal is to be able to use my best skills to build high-quality software  and  to focus on improving technical solutions that further establish organizational goals. I'm proficient in a range of modern technologies including Java, C#, and SQL. I also possess skills in Relational databases including Mysql, Microsoft SQL Server, and PostgreSQL."
}
